---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairRiserDoesntIntersectBoundaryError
source: html/17a68814-69a3-872f-8fff-c76567739cd5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairRiserDoesntIntersectBoundaryError Property

The line representing the top of a riser does not intersect one or both of the boundary lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairRiserDoesntIntersectBoundaryError { get; }
```